---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.CouldntFindNewHostsForElements
source: html/f09a7625-31aa-1858-96f8-a15582bca0f4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.CouldntFindNewHostsForElements Property

Couldn't find new hosts for elements in array.

## Syntax (C#)
```csharp
public static FailureDefinitionId CouldntFindNewHostsForElements { get; }
```